In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [2]:
fortune = pd.read_csv('..//data/Fortune_500_2017.csv', 
                   low_memory=False, 
                   usecols=['Rank','Title','Employees','Profits','Assets'],
                   index_col='Rank'
)

In [4]:
fortune.head()

                   Title  Employees  Profits  Assets
Rank
1                Walmart    2300000  13643.0  198825
2     Berkshire Hathaway     367700  24074.0  620854
3                  Apple     116000  45687.0  321686
4            Exxon Mobil      72700   7840.0  330314
5               McKesson      68000   2258.0   56563

In [9]:
rankByEmployee = fortune['Employees'].rank(ascending=False)
rankByEmployee

Rank
1        1.0
2        7.0
3       57.0
4       94.0
5      104.5
       ...
496    218.0
497    475.0
498    420.5
499    474.0
500     60.5
Name: Employees, Length: 500, dtype: float64

In [10]:
fortune['RankByEmployee'] = rankByEmployee
fortune.head()

                   Title  Employees  Profits  Assets  RankByEmployee
Rank
1                Walmart    2300000  13643.0  198825             1.0
2     Berkshire Hathaway     367700  24074.0  620854             7.0
3                  Apple     116000  45687.0  321686            57.0
4            Exxon Mobil      72700   7840.0  330314            94.0
5               McKesson      68000   2258.0   56563           104.5

In [11]:
rankByProfits = fortune['Profits'].rank(ascending=False)
rankByProfits

Rank
1       11.0
2        3.0
3        1.0
4       27.0
5      102.0
       ...
496    330.0
497    328.5
498    456.5
499    456.5
500    427.0
Name: Profits, Length: 500, dtype: float64

In [12]:
fortune['RankByProfits'] = rankByProfits
fortune.head()

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
1,Walmart,2300000,13643.0,198825,1.0,11.0
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0
3,Apple,116000,45687.0,321686,57.0,1.0
4,Exxon Mobil,72700,7840.0,330314,94.0,27.0
5,McKesson,68000,2258.0,56563,104.5,102.0

In [13]:
isEmployeesRankFirst10 = fortune['RankByEmployee'] <= 10
isProfitRankFirst10 = fortune['RankByProfits'] <= 10

In [16]:
fortune[isEmployeesRankFirst10 & isProfitRankFirst10]

,Title,Employees,Profits,Assets,RankByEmployee,RankByProfits
Rank,,,,,,
2,Berkshire Hathaway,367700,24074.0,620854,7.0,3.0

In [17]:
isEmployeesRankMore400 = fortune['RankByEmployee'] >= 400

In [18]:
fortune[isEmployeesRankMore400 & isProfitRankFirst10]

             Title  Employees  Profits  Assets  RankByEmployee  RankByProfits
Rank
148   Altria Group       8300  14239.0   45932           424.0           10.0